import streamlit as st
from menu import menu

st.title("Сервис семантического анализа документов")
TEXT = """
Этот сервис создан для ознакомления с возможностями работы различных обработчиков документов  
Для выбора типов обработки следует выбрать один из методов в меню слева:
* Simple Question Answering - может принимать на вход текстовый документ и отвечать на вопросы

* Image Question Answering - может принимать на вход изображение (скан страницы, картинки) и генерировать ответ на вопрос

* Document Question Answering - может принимать на вход несколько документов и отвечать на вопросы по содержимому во всех документах

* Question Answering on Web pages - может принимать на вход URL-адрес и отвечать на вопросы по содержимому на странице
"""
st.markdown(TEXT)
menu()
